Tekla Open API Reference for Tekla Structures 2025
View Constructor
Overload List
Name | Description
View(ContainerView, CoordinateSystem, CoordinateSystem, ArrayList)
 Creates a new view instance with the given coordinate systems and part list.
View(ContainerView, CoordinateSystem, CoordinateSystem, AABB)
 Creates a new view instance with the given coordinate systems and model area.
View(ContainerView, CoordinateSystem, CoordinateSystem, ArrayList, String)
 Creates a new view instance with the given coordinate systems, part list and attributes file's filename.
View(ContainerView, CoordinateSystem, CoordinateSystem, AABB, String)
 Creates a new view instance with the given coordinate systems, model area and attributes file's filename.
Top
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace